sdaiIsKindOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether a specified application instance is a kind of a specified type.
\param instance [in] An application instance to be checked.
\param entity   [in] An entity that represents the type.
\returns sdaiTRUE if the application instance belongs to the specified type; otherwise, the function returns false.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN Repository is not open.
* sdaiTR_NEXS Transaction does not exist.
* sdaiTR_NAVL Transaction currently not available.
* sdaiTR_EAB Transaction ended abnormally.
* sdaiMO_NEXS SDAI-model does not exist.
* sdaiED_NDEF Entity definition not defined.
* sdaiEI_NEXS Instance does not exist.
* sdaiFN_NAVL Function not available.
* sdaiSY_ERR Underlying system error.
\code
SdaiEntity typeOfinstanceToCheck = sdaiGetInstanceType(instanceToCheck);
SdaiBoolean result = sdaiIsKindOf(instanceToCheck, typeOfinstanceToCheck);